a = 5.89956
b=6.556551
print(a*b)
print (round(a*b,3)) #Принимает число, сколько знаков после запятой

iter = 2
iter += 3 # iter = iter + 3
iter -= 4 # iter = iter - 4
iter *= 5 # iter = iter * 5
iter /= 5 # iter = iter / 5
iter //= 5 # iter = iter // 5
iter %= 5 # iter = iter % 5
iter **= 5 # iter = iter ** 5 

# Знак операции Операция
# > Больше
# >= Больше или равно
# < Меньше
# <= Меньше или равно
# == Равно (проверяет, равны ли числа)
# != Не равно (проверяет, не равны ли значения)
# not Не (отрицание)
# and И (конъюнкция)
# or Или (дизъюнкция

a = 1 > 4
print(a) # False
# —------------------------------------
a = 1 < 4 and 5 > 2
print(a) # True
# —------------------------------------
a = 1 == 2
print(a) # False
# —------------------------------------
a = 1 != 2
print(a) # True
a = 'qwe'
b = 'qwe'
print(a == b) # True

a = 1 < 3 < 5 < 10
print (a) # True